"""2. Создать текстовый файл (не программно), сохранить в нем несколько строк,
выполнить подсчет количества строк, количества слов в каждой строке.
"""
# Подсчёт количества строк в файле:

# my_f = open("text_file.txt")

# count = 0
# with my_f as f:
#     for line in f:
#         count += 1
# print("Количество строк в файле: ", count)
# my_f.close()

# Подсчёт количества слов в каждой строке файла:

# my_f = open("text_file.txt")

# count = 1
# with my_f as f:
#     for line in f:
#         words = len(line.split())
#         print(f"Количество слов в строке {count}: {words}")
#         count += 1

# my_f.close()
